ezequieldonhauser/PIC18F452_ENC28J60/Microchip/TCPIP Stack/ENCX24J600.c
/******************************************************************************
 * Function:        void ENC100Init(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACInit sets up the PIC's SPI module and all the 
 *					registers in the ENC624J600 so that normal operation can 
 *					begin.
 *
 * Note:            None
 *****************************************************************************/
void MACInit(void)
{
	WORD w;

	#if defined(ENC100_INT_TRIS)	// Interrupt output from ENCx24J600
		ENC100_INT_TRIS = 1;
	#endif
	#if defined(ENC100_MDIX_TRIS)	// MDIX control pin from PIC
		ENC100_MDIX_TRIS = 0;
		ENC100_MDIX_IO = 0;
	#endif

	#if (ENC100_INTERFACE_MODE >= 1)	// Parallel mode
		#if defined(ENC100_CS_TRIS)
			DeassertChipSelect();
			ENC100_CS_TRIS = 0;
		#endif		
		ENC100_SO_WR_B0SEL_EN_IO = 0;
		ENC100_SO_WR_B0SEL_EN_TRIS = 0;
		ENC100_SI_RD_RW_IO = 0;
		ENC100_SI_RD_RW_TRIS = 0;
		#if ENC100_INTERFACE_MODE >= 5	// If PSP address bus is multiplexed, then set Address Latch TRIS bit to output
			ENC100_SCK_AL_IO = 0;
			ENC100_SCK_AL_TRIS = 0;
		#endif

		#if !defined(ENC100_BIT_BANG_PMP)
			// PMCON register
			PMCONbits.PMPEN = 1;
			#if ENC100_INTERFACE_MODE >= 5	// Multiplexed mode
				#if defined(__PIC32MX__) && ((ENC100_INTERFACE_MODE == 9) || (ENC100_INTERFACE_MODE == 10))
					// PIC32s can use 16-bit data bus with address multiplexing that doesn't clobber Explorer 16 UART2 or other functions
					PMCONbits.ADRMUX = 0x3;	// 16-bit data + full address muxing
				#else
					PMCONbits.ADRMUX = 0x1;	// 8-bit data + partial address muxing
				#endif
			#else
				PMCONbits.ADRMUX = 0x0;	// Fully demultiplexed address
			#endif
			PMCONbits.PTWREN = 1;	// Enable PMWR strobe
			PMCONbits.PTRDEN = 1;	// Enable PMRD strobe
			PMCONbits.ALP = 1;		// AL strobe is active high polarity
			PMCONbits.WRSP = 1;		// PMWR strobe is active high polarity
			PMCONbits.RDSP = 1;		// PMRD strobe is active high polarity

			// PMMODE register
			PMMODEbits.INCM = 0x0;	// No address increment
			#if defined(__PIC32MX__) && ((ENC100_INTERFACE_MODE == 3) || (ENC100_INTERFACE_MODE == 4) || (ENC100_INTERFACE_MODE == 9) || (ENC100_INTERFACE_MODE == 10))
				PMMODEbits.MODE16 = 1;	// 16-bit mode
			#else
				PMMODEbits.MODE16 = 0;	// 8-bit mode
			#endif
			#if (ENC100_INTERFACE_MODE == 1) || (ENC100_INTERFACE_MODE == 3) || (ENC100_INTERFACE_MODE == 5) || (ENC100_INTERFACE_MODE == 9)	// READ, WRITE strobes
				PMMODEbits.MODE = 0x2;	// Master mode 2: PMRD & PMWR, not PMRD/PMWR & PMENB
			#else	// READ/WRITE, ENABLE strobes
				PMMODEbits.MODE = 0x1;
			#endif
			PMMODEbits.WAITB = 0x0;	// 1Tcy wait for set up time and address latch time
			// Calculate the minimum number of wait states to ensure a 75ns or longer pulse width for READ and WRITE strobes
			#if defined(__PIC32MX__)	// PIC32 is offset by one (i.e. 0 = one wait state)
				#define OPTIMAL_PMP_WAIT_STATES ((BYTE)((double)GetPeripheralClock()*0.000000075))
			#else
				#define OPTIMAL_PMP_WAIT_STATES ((BYTE)((double)GetPeripheralClock()*0.000000075 + 0.9999))
			#endif
			PMMODEbits.WAITM = OPTIMAL_PMP_WAIT_STATES;
			PMMODEbits.WAITE = 0x0;	// 1Tcy wait for hold time

			// PMAEN address enables register			
			#if (ENC100_INTERFACE_MODE == 1) || (ENC100_INTERFACE_MODE == 2) // 8-bit demux
				PMAEN = ENC100_TRANSLATE_TO_PIN_ADDR(0x7FFF);
			#elif (ENC100_INTERFACE_MODE == 3) || (ENC100_INTERFACE_MODE == 4)	// 16-bit demux
				PMAEN = ENC100_TRANSLATE_TO_PIN_ADDR(0x3FFF);
				#if !defined(__PIC32MX__)
					#error 16-bit PMP mode is only available on PIC32.  Use ENC100_INTERFACE_MODE of 1, 2, 5, or 6 (8-bit) instead.
				#endif
			#elif (ENC100_INTERFACE_MODE == 5) || (ENC100_INTERFACE_MODE == 6)	// 8-bit mux
				PMAEN = ENC100_TRANSLATE_TO_PIN_ADDR(0x7F00) | 0x0001;
			#elif (ENC100_INTERFACE_MODE == 9) || (ENC100_INTERFACE_MODE == 10)	// 16-bit mux
				PMAEN = 0x0001; // Connect PMA<0> to AL
				#if !defined(__PIC32MX__)
					#error 16-bit PMP mode is only available on PIC32.  Use ENC100_INTERFACE_MODE of 1, 2, 5, or 6 (8-bit) instead.
				#endif
			#endif

			// Use CMOS schmitt trigger input buffers
			#if defined(__PIC32MX__)
				PMCONbits.PMPTTL = 0;	
			#else
				PADCFG1bits.PMPTTL = 0;
			#endif
		#endif
	#else	// Use SPI interface
		vCurrentBank = 0;			// Needed for SPI only

		// Set up the SPI module on the PIC for communications with the ENC624J600
		DeassertChipSelect();
		ENC100_CS_TRIS = 0;
	    	    
	    // Set up SPI
		#if defined(__18CXX)
			ENC100_SCK_AL_TRIS = 0;
			ENC100_SI_RD_RW_TRIS = 0;
			ENC100_SO_WR_B0SEL_EN_TRIS = 1;

			ENC100_SPICON1 = 0x20;		// SSPEN bit is set, SPI in master mode, FOSC/4, 
										//   IDLE state is low level
			ENC100_SPI_IF = 0;
			ENC100_SPISTATbits.CKE = 1;	// Transmit data on rising edge of clock
			ENC100_SPISTATbits.SMP = 0;	// Input sampled at middle of data output time
		#elif defined(__C30__)
		    ENC100_SPISTAT = 0;    		// clear SPI

			// Ensure SPI doesn't exceed processor limit
			#if (defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__)) && ENC100_MAX_SPI_FREQ > 8000000
				#undef ENC100_MAX_SPI_FREQ
				#define ENC100_MAX_SPI_FREQ	8000000
			#endif
			#if defined(__dsPIC30F__) && ENC100_MAX_SPI_FREQ > 10000000
				#undef ENC100_MAX_SPI_FREQ
				#define ENC100_MAX_SPI_FREQ	10000000
			#endif
		    
		    // Calculate optimal primary and secondary prescalers to make an SPI clock no faster than ENC100_MAX_SPI_FREQ
		    #if GetPeripheralClock()/8/64 > ENC100_MAX_SPI_FREQ
		    	#warning Minimum possible SPI frequency is faster than ENC100_MAX_SPI_FREQ
		    #endif
	    	#define OPTIMAL_PRESCALE		((((~((GetPeripheralClock()/64+ENC100_MAX_SPI_FREQ-1)/ENC100_MAX_SPI_FREQ - 1)) & 0x7)<<2) | 0x0)
		    #if GetPeripheralClock()/8/16 <= ENC100_MAX_SPI_FREQ
		    	#undef OPTIMAL_PRESCALE
		    	#define OPTIMAL_PRESCALE	((((~((GetPeripheralClock()/16+ENC100_MAX_SPI_FREQ-1)/ENC100_MAX_SPI_FREQ - 1)) & 0x7)<<2) | 0x1)
		    #endif
		    #if GetPeripheralClock()/8/4 <= ENC100_MAX_SPI_FREQ
		    	#undef OPTIMAL_PRESCALE
	    		#define OPTIMAL_PRESCALE	((((~((GetPeripheralClock()/4+ENC100_MAX_SPI_FREQ-1)/ENC100_MAX_SPI_FREQ - 1)) & 0x7)<<2) | 0x2)
		    #endif
		    #if GetPeripheralClock()/8/1 <= ENC100_MAX_SPI_FREQ
		    	#undef OPTIMAL_PRESCALE
		    	#define OPTIMAL_PRESCALE	((((~((GetPeripheralClock()/1+ENC100_MAX_SPI_FREQ-1)/ENC100_MAX_SPI_FREQ - 1)) & 0x7)<<2) | 0x3)
		    #endif

			// Work around 1:1, 1:1 SPI errata on early PIC24FJ128GA010, PIC24HJ256GP610, dsPIC33FJ256GP710, etc. silicon where SCK stops running
			#if (defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__)) && (OPTIMAL_PRESCALE == 0x1F)
				#undef OPTIMAL_PRESCALE
				#define OPTIMAL_PRESCALE	0x1B
			#endif

			ENC100_SPICON1 = OPTIMAL_PRESCALE;
		    ENC100_SPICON2 = 0;
		    ENC100_SPICON1bits.CKE = 1;
		    ENC100_SPICON1bits.MSTEN = 1;
		    ENC100_SPISTATbits.SPIEN = 1;
		#elif defined(__C32__)
			ENC100_SPIBRG = (GetPeripheralClock()-1ul)/2ul/ENC100_MAX_SPI_FREQ;
		    ENC100_SPICON1bits.CKE = 1;
		    ENC100_SPICON1bits.MSTEN = 1;
			ENC100_SPICON1bits.ON = 1;
		#endif
	#endif


